## Without use AnyEncoding

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [3]:
#load dataset
df=pd.read_csv("online.csv")
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [4]:
# Without use AnyEncoding
df.Area.unique()

array(['Dhaka', 'Ctg', 'Rangpur'], dtype=object)

In [5]:
df.Area=df.Area.replace(['Dhaka', 'Ctg', 'Rangpur'],[3,2,1])
df.Area.head(10)

0    3
1    2
2    1
3    3
4    1
5    3
6    2
7    1
8    3
9    2
Name: Area, dtype: int64

In [6]:
df.head()

   Marketing Spend  Administration  Transport  Area     Profit
0        114523.61       136897.80  471784.10     3  192261.83
1        162597.70       151377.59  443898.53     2  191792.06
2        153441.51       101145.55  407934.54     1  191050.39
3        144372.41       118671.85  383199.62     3  182901.99
4        142107.34        91391.77  366168.42     1  166187.94